CF/Documents/ЗаменаДисконтныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ЗаменаДисконтныхКарт</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.РегистрацияЗаменыКартПокупателей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КартыПокупателей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КартаИсточник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КартаПриемник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CF/Catalogs/ИнформационныеКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ИнформационныеКарты</Name>
			<Comment>(Упр) Магнитные и штриховые карты.</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИнформационныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДисконтнойКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДисконтныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИнформационныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоОпроса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСледующегоОпроса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БонуснаяПрограммаЛояльности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БонусныеПрограммыЛояльности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартаДляНакоплений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаВладельцаКартыПоШаблону</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CF/Documents/ЗаменаДисконтныхКарт/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Замена владельца для карт
//
// Параметры:
//  Объект - ДокументОбъект.ЗаменаДисконтныхКарт
//  Замещать - Булево , Если Истина, то владелец перезаписывается.
//
Процедура ЗаменитьВладельца(Объект, Замещать) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(КартыПокупателей.КартаИсточник КАК Справочник.ИнформационныеКарты) КАК КартаИсточник,
	|	ВЫРАЗИТЬ(КартыПокупателей.КартаПриемник КАК Справочник.ИнформационныеКарты) КАК КартаПриемник
	|ПОМЕСТИТЬ ТаблицаЗапроса
	|ИЗ
	|	&КартыПокупателей КАК КартыПокупателей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗапроса.КартаИсточник,
	|	ТаблицаЗапроса.КартаПриемник,
	|	ТаблицаЗапроса.КартаИсточник.ВладелецКарты КАК ВладелецКарты
	|ИЗ
	|	ТаблицаЗапроса КАК ТаблицаЗапроса
	|ГДЕ
	|	ТаблицаЗапроса.КартаИсточник.ВладелецКарты <> ТаблицаЗапроса.КартаПриемник.ВладелецКарты
	|	И (НЕ ТаблицаЗапроса.КартаИсточник.ВладелецКарты = НЕОПРЕДЕЛЕНО)
	|	И (&Замещать
	|			ИЛИ ТаблицаЗапроса.КартаПриемник.ВладелецКарты = НЕОПРЕДЕЛЕНО)";
	
	Запрос.УстановитьПараметр("КартыПокупателей", Объект.КартыПокупателей.Выгрузить());
	Запрос.УстановитьПараметр("Замещать"        , Замещать);
	
	Результат = Запрос.Выполнить();
	ТаблицаЗапроса = Результат.Выгрузить();
	
	Если ТаблицаЗапроса.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Обработка заполнения не потребовалась'"), Объект);
		Возврат;
	КонецЕсли;
	
	Количество = 0;
	Для каждого СтрокаТаблицыЗапроса Из ТаблицаЗапроса Цикл
		
		ОбъектИнформационнаяКарта = СтрокаТаблицыЗапроса.КартаПриемник.ПолучитьОбъект();
		ОбъектИнформационнаяКарта.ВладелецКарты = СтрокаТаблицыЗапроса.ВладелецКарты;
		ОбъектИнформационнаяКарта.Записать();
		Количество = Количество + 1;
		
	КонецЦикла;
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Заполнено владельцев: %1'"),
		Строка(Количество));
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект);
	
КонецПроцедуры

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	//
	ТекстЗапроса = ТекстЗапросаТаблицаРегистрацияЗаменыКартПокупателей();
	Запрос = Новый Запрос();
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	//
	ТаблицыДляДвижений = СтруктураДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаРегистрацияЗаменыКартПокупателей", МассивРезультатов[0].Выгрузить());
	
КонецПроцедуры

// Замена владельца для карт
//
// Параметры:
//  Объект - ДокументОбъект.ЗаменаДисконтныхКарт
//  Замещать - Булево , Если Истина, то владелец перезаписывается.
//
Процедура ПеренестиДанныеОБонуснойПрограмме(Объект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(КартыПокупателей.КартаИсточник КАК Справочник.ИнформационныеКарты) КАК КартаИсточник,
	|	ВЫРАЗИТЬ(КартыПокупателей.КартаПриемник КАК Справочник.ИнформационныеКарты) КАК КартаПриемник
	|ПОМЕСТИТЬ ТаблицаЗапроса
	|ИЗ
	|	&КартыПокупателей КАК КартыПокупателей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗапроса.КартаИсточник,
	|	ТаблицаЗапроса.КартаПриемник,
	|	ТаблицаЗапроса.КартаИсточник.БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности,
	|	ТаблицаЗапроса.КартаИсточник.КартаДляНакоплений КАК КартаДляНакоплений
	|ИЗ
	|	ТаблицаЗапроса КАК ТаблицаЗапроса
	|ГДЕ
	|	ТаблицаЗапроса.КартаИсточник.БонуснаяПрограммаЛояльности <> ТаблицаЗапроса.КартаПриемник.БонуснаяПрограммаЛояльности
	|	ИЛИ ТаблицаЗапроса.КартаИсточник.КартаДляНакоплений <> ТаблицаЗапроса.КартаПриемник.КартаДляНакоплений
	|";
	
	Запрос.УстановитьПараметр("КартыПокупателей", Объект.КартыПокупателей.Выгрузить());
	
	Результат = Запрос.Выполнить();
	ТаблицаЗапроса = Результат.Выгрузить();
	
	Если ТаблицаЗапроса.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Обработка заполнения не потребовалась'"), Объект);
		Возврат;
	КонецЕсли;
	
	Количество = 0;
	Для каждого СтрокаТаблицыЗапроса Из ТаблицаЗапроса Цикл
		
		ОбъектИнформационнаяКарта = СтрокаТаблицыЗапроса.КартаПриемник.ПолучитьОбъект();
		ОбъектИнформационнаяКарта.БонуснаяПрограммаЛояльности = СтрокаТаблицыЗапроса.БонуснаяПрограммаЛояльности;
		ОбъектИнформационнаяКарта.КартаДляНакоплений = СтрокаТаблицыЗапроса.КартаДляНакоплений;
		ОбъектИнформационнаяКарта.Записать();
		Количество = Количество + 1;
		
	КонецЦикла;
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Обработано карт: %1'"),
		Строка(Количество));
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект);
	
КонецПроцедуры

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция формирует текст запроса для таблицы Регистрация замены карт покупателей.
//
// Возвращаемое значение:
//	Строка - Текст запроса
//
Функция ТекстЗапросаТаблицаРегистрацияЗаменыКартПокупателей()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ЗаменаДисконтныхКартКартыПокупателей.Ссылка        КАК Ссылка,
	|	ЗаменаДисконтныхКарт.Дата                          КАК Период,
	|	ЗаменаДисконтныхКартКартыПокупателей.КартаИсточник КАК КартаИсточник,
	|	ЗаменаДисконтныхКартКартыПокупателей.КартаПриемник КАК КартаПриемник
	|	
	|ИЗ
	|	Документ.ЗаменаДисконтныхКарт.КартыПокупателей КАК ЗаменаДисконтныхКартКартыПокупателей
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.ЗаменаДисконтныхКарт КАК ЗаменаДисконтныхКарт
	|ПО
	|	ЗаменаДисконтныхКартКартыПокупателей.Ссылка = ЗаменаДисконтныхКарт.Ссылка
	|ГДЕ
	|	ЗаменаДисконтныхКартКартыПокупателей.Ссылка = &Ссылка
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#КонецЕсли
